#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖[32m[1mSuccess![0m The configuration is valid.
[0m

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
[0m[1mdata.terraform_remote_state.s3_bucket_uat: Reading...[0m[0m
[0m[1mdata.terraform_remote_state.s3_bucket_uat: Read complete after 0s[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create
[0m
Terraform will perform the following actions:

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/About-41cfd9b3.js"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "application/javascript"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/About-41cfd9b3.js"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/About-41cfd9b3.js"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "c7f5ea1ef4f9513680640996d3ed3657"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ArticleLayouts-0832ce36.js"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "application/javascript"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/ArticleLayouts-0832ce36.js"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/ArticleLayouts-0832ce36.js"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "b405602afe9e28dc48e0b719ae1bfedc"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-c07800fd.js"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "application/javascript"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/Articles-c07800fd.js"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/Articles-c07800fd.js"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "eb2bf38d393e51948a86aacc27026f7b"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Articles-cdca7afd.css"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "text/css"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/Articles-cdca7afd.css"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/Articles-cdca7afd.css"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "d254e9f4850a323e5ea30df3ac31964d"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-55994a62.css"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "text/css"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/Landing-55994a62.css"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/Landing-55994a62.css"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "b48e92d99a74536053cfb086f1cf666d"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Landing-c02f9a13.js"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "application/javascript"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/Landing-c02f9a13.js"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/Landing-c02f9a13.js"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "a7c0932ab610b7b65295722ff73eb3d0"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-2166aad4.css"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "text/css"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/PDF-2166aad4.css"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/PDF-2166aad4.css"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "00fb11129144eb048b60320a1ca0c77b"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-7827ee5f.js"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "application/javascript"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/PDF-7827ee5f.js"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/PDF-7827ee5f.js"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "b30fa77973ee6b6d758eb3dae8f4b0b8"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Start-1478f226.js"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "application/javascript"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/Start-1478f226.js"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/Start-1478f226.js"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "0af1186a2627c444a6a33013e3f9e5d7"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartButtonFloat-30662b5b.css"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "text/css"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/StartButtonFloat-30662b5b.css"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/StartButtonFloat-30662b5b.css"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "4f9643d47026450c9ee5b6cc273c47c2"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/StartButtonFloat-75808506.js"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "application/javascript"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/StartButtonFloat-75808506.js"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/StartButtonFloat-75808506.js"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "d0124d833f2374299044c31bf1a8eed0"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Terminal-2e2ec67e.css"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "text/css"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/Terminal-2e2ec67e.css"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/Terminal-2e2ec67e.css"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "85561bf1ef41088b8c3f0f50a6a1fa81"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/Terminal-e654d540.js"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "application/javascript"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/Terminal-e654d540.js"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/Terminal-e654d540.js"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "4dc5e5a13cc2056d1c06f0ae66219cb9"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/azure_devicon_forest_green-00278e7c.svg"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "image/svg+xml"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/azure_devicon_forest_green-00278e7c.svg"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/azure_devicon_forest_green-00278e7c.svg"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "e60911495dba8bb96def57539a94e9cf"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/bash_devicon_forest_green-d16e0666.svg"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "image/svg+xml"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/bash_devicon_forest_green-d16e0666.svg"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/bash_devicon_forest_green-d16e0666.svg"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "302f026f7e053d0ccf4b0ed827f15900"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/d3_devicon_forest_green-1e07de82.svg"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "image/svg+xml"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/d3_devicon_forest_green-1e07de82.svg"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/d3_devicon_forest_green-1e07de82.svg"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "89db6545390762231d3913a3cd717cf3"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/devicons-4cbd2440.woff"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "font/woff"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/devicons-4cbd2440.woff"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/devicons-4cbd2440.woff"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "a8639dec5833a8375d22fe425b01f4eb"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/devicons-880373aa.eot"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "application/vnd.ms-fontobject"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/devicons-880373aa.eot"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/devicons-880373aa.eot"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "36c5ab9318386dc0499a0d89691e6331"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/devicons-cbb92633.ttf"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "font/ttf"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/devicons-cbb92633.ttf"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/devicons-cbb92633.ttf"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "5ed4d6468a5a0f3cf9c82f854936feab"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/devicons-d7c9f264.svg"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "image/svg+xml"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/devicons-d7c9f264.svg"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/devicons-d7c9f264.svg"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "3364e4c1c38b1d141d6f12a441546cdc"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/fontawesome-webfont-2adefcbc.woff2"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "font/woff2"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/fontawesome-webfont-2adefcbc.woff2"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/fontawesome-webfont-2adefcbc.woff2"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "af7ae505a9eed503f8b8e6982036873e"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/fontawesome-webfont-7bfcab6d.eot"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "application/vnd.ms-fontobject"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/fontawesome-webfont-7bfcab6d.eot"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/fontawesome-webfont-7bfcab6d.eot"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "674f50d287a8c48dc19ba404d20fe713"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/fontawesome-webfont-aa58f33f.ttf"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "font/ttf"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/fontawesome-webfont-aa58f33f.ttf"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/fontawesome-webfont-aa58f33f.ttf"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "b06871f281fee6b241d60582ae9369b9"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/fontawesome-webfont-ad615792.svg"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "image/svg+xml"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/fontawesome-webfont-ad615792.svg"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/fontawesome-webfont-ad615792.svg"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "8ef356884e8bc0128e25921e21fab64f"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/fontawesome-webfont-ba0c59de.woff"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "font/woff"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/fontawesome-webfont-ba0c59de.woff"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/fontawesome-webfont-ba0c59de.woff"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "fee66e712a8a08eef5805a46892932ad"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/github_profile_pic-66b10136.jpg"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "image/jpeg"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/github_profile_pic-66b10136.jpg"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/github_profile_pic-66b10136.jpg"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "a85d8d094e6d9a7903c5829c0ed09432"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/html2canvas.esm-0a33ed42.js"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "application/javascript"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/html2canvas.esm-0a33ed42.js"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/html2canvas.esm-0a33ed42.js"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "955bf9b222a46a0897ad2d52916463de"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index-79ca4b23.js"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "application/javascript"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/index-79ca4b23.js"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/index-79ca4b23.js"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "41e7e57859d1482dfb47846133b19216"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index-9a0f5c31.css"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "text/css"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/index-9a0f5c31.css"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/index-9a0f5c31.css"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "45acb66fcc4bb14921fc31218d5333c0"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/index.es-2ebeaddd.js"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "application/javascript"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/index.es-2ebeaddd.js"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/index.es-2ebeaddd.js"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "e278b224581d95c7680b65d5e7dee344"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/powershell_devicon_forest_green-25e7cded.svg"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "image/svg+xml"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/powershell_devicon_forest_green-25e7cded.svg"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/powershell_devicon_forest_green-25e7cded.svg"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "3af47f89e61fe763b909c1fabc4c4083"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/purify.es-3ef59d4c.js"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "application/javascript"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/purify.es-3ef59d4c.js"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/purify.es-3ef59d4c.js"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "f17593fbd13b830e8b0da63f75b8f242"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/recase-b12b8868.js"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "application/javascript"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/recase-b12b8868.js"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/recase-b12b8868.js"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "71973ad25d4adfade3bb472a2fd9afd8"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/tableau_logo-c0ec519e.svg"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "image/svg+xml"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/tableau_logo-c0ec519e.svg"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/tableau_logo-c0ec519e.svg"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "b42fa60cb28ab38ad51179e8b40ff867"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/terraform_devicon_forest_green-e8473ede.svg"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "image/svg+xml"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/terraform_devicon_forest_green-e8473ede.svg"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/terraform_devicon_forest_green-e8473ede.svg"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "ab25c8b031fc668e363745b71dd395a2"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/ts_devicon_forest_green-e8483eba.svg"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "image/svg+xml"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/ts_devicon_forest_green-e8483eba.svg"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/ts_devicon_forest_green-e8483eba.svg"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "52658f776f4a1d3b285bc64c540aa7c5"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["assets/vue_devicon_forest_green-d8b386fc.svg"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "image/svg+xml"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "assets/vue_devicon_forest_green-d8b386fc.svg"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/assets/vue_devicon_forest_green-d8b386fc.svg"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "b445c5110e3b0a783cfb923e99665079"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["favicon.ico"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "image/x-icon"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "favicon.ico"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/favicon.ico"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "15789dada2974fe2e62d763285aa97f0"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[1m  # module.s3_object_uat.aws_s3_bucket_object.this["index.html"][0m will be created[0m[0m
[0m  [32m+[0m[0m resource "aws_s3_bucket_object" "this" {
      [32m+[0m [0m[1m[0macl[0m[0m                    = "public-read"
      [32m+[0m [0m[1m[0mbucket[0m[0m                 = "uat.marshmallowmeat.com"
      [32m+[0m [0m[1m[0mbucket_key_enabled[0m[0m     = (known after apply)
      [32m+[0m [0m[1m[0mcache_control[0m[0m          = "max-age=31536000, immutable"
      [32m+[0m [0m[1m[0mcontent_type[0m[0m           = "text/html"
      [32m+[0m [0m[1m[0metag[0m[0m                   = (known after apply)
      [32m+[0m [0m[1m[0mforce_destroy[0m[0m          = true
      [32m+[0m [0m[1m[0mid[0m[0m                     = (known after apply)
      [32m+[0m [0m[1m[0mkey[0m[0m                    = "index.html"
      [32m+[0m [0m[1m[0mkms_key_id[0m[0m             = (known after apply)
      [32m+[0m [0m[1m[0mserver_side_encryption[0m[0m = (known after apply)
      [32m+[0m [0m[1m[0msource[0m[0m                 = "./../../../../../shortpoet_site/index.html"
      [32m+[0m [0m[1m[0msource_hash[0m[0m            = "addd68c3b53f697e3611492cd5204084"
      [32m+[0m [0m[1m[0mstorage_class[0m[0m          = "STANDARD"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mtags_all[0m[0m               = {
          [32m+[0m [0m"Bucket"          = "uat.marshmallowmeat.com"
          [32m+[0m [0m"CloudFlare"      = "true"
          [32m+[0m [0m"CloudFlare_Zone" = "marshmallowmeat.com"
          [32m+[0m [0m"Project"         = "tf-web"
          [32m+[0m [0m"Terraform"       = "true"
        }
      [32m+[0m [0m[1m[0mversion_id[0m[0m             = (known after apply)
    }

[0m[1mPlan:[0m 39 to add, 0 to change, 0 to destroy.
[0m[0m
[1mChanges to Outputs:[0m[0m
  [32m+[0m [0m[1m[0ms3_bucket_object_etags[0m[0m       = [
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
    ]
  [32m+[0m [0m[1m[0ms3_bucket_object_ids[0m[0m         = [
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
    ]
  [32m+[0m [0m[1m[0ms3_bucket_object_keys_ids[0m[0m    = [
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/About-41cfd9b3.js"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/ArticleLayouts-0832ce36.js"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/Articles-c07800fd.js"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/Articles-cdca7afd.css"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/Landing-55994a62.css"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/Landing-c02f9a13.js"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/PDF-2166aad4.css"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/PDF-7827ee5f.js"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/Start-1478f226.js"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/StartButtonFloat-30662b5b.css"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/StartButtonFloat-75808506.js"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/Terminal-2e2ec67e.css"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/Terminal-e654d540.js"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/azure_devicon_forest_green-00278e7c.svg"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/bash_devicon_forest_green-d16e0666.svg"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/d3_devicon_forest_green-1e07de82.svg"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/devicons-4cbd2440.woff"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/devicons-880373aa.eot"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/devicons-cbb92633.ttf"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/devicons-d7c9f264.svg"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/fontawesome-webfont-2adefcbc.woff2"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/fontawesome-webfont-7bfcab6d.eot"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/fontawesome-webfont-aa58f33f.ttf"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/fontawesome-webfont-ad615792.svg"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/fontawesome-webfont-ba0c59de.woff"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/github_profile_pic-66b10136.jpg"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/html2canvas.esm-0a33ed42.js"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/index-79ca4b23.js"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/index-9a0f5c31.css"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/index.es-2ebeaddd.js"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/powershell_devicon_forest_green-25e7cded.svg"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/purify.es-3ef59d4c.js"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/recase-b12b8868.js"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/tableau_logo-c0ec519e.svg"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/terraform_devicon_forest_green-e8473ede.svg"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/ts_devicon_forest_green-e8483eba.svg"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "assets/vue_devicon_forest_green-d8b386fc.svg"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "favicon.ico"
        },
      [32m+[0m [0m{
          [32m+[0m [0mid  = (known after apply)
          [32m+[0m [0mkey = "index.html"
        },
    ]
  [32m+[0m [0m[1m[0ms3_bucket_object_version_ids[0m[0m = [
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
      [32m+[0m [0m(known after apply),
    ]
[33m╷[0m[0m
[33m│[0m [0m[1m[33mWarning: [0m[0m[1mArgument is deprecated[0m
[33m│[0m [0m
[33m│[0m [0m[0m  with module.s3_object_uat.aws_s3_bucket_object.this["assets/PDF-2166aad4.css"],
[33m│[0m [0m  on ../../modules/s3_object/s3_object.tf line 12, in resource "aws_s3_bucket_object" "this":
[33m│[0m [0m  12:   bucket              = [4mlocal.bucket[0m[0m
[33m│[0m [0m
[33m│[0m [0mUse the aws_s3_object resource instead
[33m│[0m [0m
[33m│[0m [0m(and 77 more similar warnings elsewhere)
[33m╵[0m[0m
```

</details>

*Pusher: @shortpoet, Action: `pull_request`, Working Directory: ``, Workflow: `Deploy`*